# 판다스 과제
## 데이터 설명
* customer_id: 고객 ID
* name: 고객 이름
* age: 고객 나이
* signup_date: 가입 날짜
* purchase_amount: 구매 금액
* is_active: 활성 상태

In [10]:
import pandas as pd
# 데이터 생성
data_dict = {
    "customer_id": [101, 102, 103, 104, 105],
    "name": ["Alice", "Bob", "Charlie", None, "Eva"],
    "age": [25.0, 30.0, 28.0, 40.0, 35.0],
    "signup_date": ["2023-01-15", "2023-02-20", "2023-03-20", "2023-03-01", "2023-04-10"],
    "purchase_amount": [120.50, 120.2, 200.00, 150.75, 300.40],
    "is_active": [True, False, "yes", "no", True],
    "group": ["A", "A", "B", "C", "C"]
}

# 데이터프레임 생성
df = pd.DataFrame(data_dict)
df

   customer_id     name   age signup_date  purchase_amount is_active group
0          101    Alice  25.0  2023-01-15           120.50      True     A
1          102      Bob  30.0  2023-02-20           120.20     False     A
2          103  Charlie  28.0  2023-03-20           200.00       yes     B
3          104     None  40.0  2023-03-01           150.75        no     C
4          105      Eva  35.0  2023-04-10           300.40      True     C

## 문제
1. is_active 열만 추출(loc 이용, iloc 이용)
1. age, group 열만 추출(loc 이용, iloc 이용)
1. customer_id가 105인 행만 추출(loc 이용, iloc 이용)
1. customer_id 가 103, 104, 105인 행만 추출(loc 이용, iloc 이용)
1. charlie 의 group 추출(loc 이용, iloc 이용)
1. customer_id 가 102, 103인 데이터의 name, age 추출(loc 이용, iloc 이용)
1. Alice 의 customer_id, name, age  추출 (loc 이용, iloc 이용)
1. Bob, Eva 의 signup_date, is_activate 추출

In [18]:
# 1.

df.loc[:, "is_active"]
df.iloc[:, 5]

0     True
1    False
2      yes
3       no
4     True
Name: is_active, dtype: object

In [ ]:
# 2.
df.loc[:, ["age", "group"]]
df.iloc[:, [2, 6]]

    age group
0  25.0     A
1  30.0     A
2  28.0     B
3  40.0     C
4  35.0     C

In [24]:
# 3.
df.loc[4, :]
df.iloc[[4], :]

   customer_id name   age signup_date  purchase_amount is_active group
4          105  Eva  35.0  2023-04-10            300.4      True     C

In [29]:
# 4.
df.loc[[2, 3, 4], :]
df.iloc[[2, 3, 4], :]

   customer_id     name   age signup_date  purchase_amount is_active group
2          103  Charlie  28.0  2023-03-20           200.00       yes     B
3          104     None  40.0  2023-03-01           150.75        no     C
4          105      Eva  35.0  2023-04-10           300.40      True     C

In [ ]:
# 5.
df.loc[2, "group"]
df.iloc[2, 6]

In [31]:
# 6.
df.loc[[1,2], ["name", "age"]]
df.iloc[[1,2], [1,2]]

      name   age
1      Bob  30.0
2  Charlie  28.0

In [34]:
# 7.
df.loc[[0], ["customer_id", "name", "age"]] 
df.iloc[[0], [0, 1, 2]]

   customer_id   name   age
0          101  Alice  25.0

In [37]:
# 8.
df.loc[[1, 4], ["signup_date", "is_active"]]
df.iloc[[1, 4], [3, 5]]

  signup_date is_active
1  2023-02-20     False
4  2023-04-10      True